#### Working Directory 📁`terraform/github_iam_role`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_policy.ReadOnlyAccess: Reading...
data.aws_iam_policy_document.allowUpdateStateLockDdb: Reading...
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.allowUpdateStateLockDdb: Read complete after 0s [id=983276191]
aws_iam_policy.allowUpdateStateLockDdb: Refreshing state... [id=arn:aws:iam::206863353204:policy/allowUpdateStateLockDdb]
data.aws_iam_policy.ReadOnlyAccess: Read complete after 0s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]
data.aws_caller_identity.current: Read complete after 0s [id=206863353204]
data.aws_iam_policy_document.github_actions_terraform_plan_assume_role_policy: Reading...
data.aws_iam_policy_document.github_actions_terraform_plan_assume_role_policy: Read complete after 0s [id=448876732]
aws_iam_role.github_actions_terraform_plan: Refreshing state... [id=GitHubActionsTerraformPlan]
aws_iam_role_policy_attachment.allowUpdateStateLockDdb: Refreshing state... [id=GitHubActionsTerraformPlan-20240121064224983000000001]
aws_iam_role_policy_attachment.ReadOnlyAccess: Refreshing state... [id=GitHubActionsTerraformPlan-20240121062846537100000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.developer will be created
  + resource "aws_iam_role" "developer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:akashikaikyouohasi/terraform-cicd-verification:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::206863353204:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/ReadOnlyAccess",
        ]
      + max_session_duration  = 3600
      + name                  = "GitHubActionsTerraformPlan"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "allowUpdateStateLockDdb"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:GetItem",
                              + "dynamodb:PutItem",
                              + "dynamodb:DeleteItem",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @akashikaikyouohasi, Action: `pull_request`, Working Directory: ``, Workflow: `terraform fmt/validate/plan`*